Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Pms/Std/IfxPmsPm.c
/**
 * \file IfxPmsPm.c
 * \brief PMS  basic functionality
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "IfxPmsPm.h"

/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/

void IfxPmsPm_setStandbyMode(Ifx_PMS *pms, IfxPmsPm_WakeupConfig *config, IfxPmsPm_RequestPowerMode powerMode)
{
    uint8  alarmGroup  = 8;
    uint32 alarmMask   = 0x1DU;
    uint8  smuTrapEnable;
    uint32 wait_cycles = 0;
    uint16 cpuWdtPw    = IfxScuWdt_getCpuWatchdogPassword();
    uint16 safetyWdtPw = IfxScuWdt_getSafetyWatchdogPassword();
    {
        /* Disable TRAP for SMU (oscillator watchdog and unlock detection) */
        IfxScuWdt_clearCpuEndinit(cpuWdtPw);
        smuTrapEnable           = SCU_TRAPDIS0.B.CPU0SMUT;
        SCU_TRAPDIS0.B.CPU0SMUT = 1U;
        IfxScuWdt_setCpuEndinit(cpuWdtPw);
    }

    /* Select fback (fosc-evr) as CCU input clock */
    IfxScuWdt_clearSafetyEndinit(safetyWdtPw);
    /* Disable SMU Alarms  */
    {
        /* Enable access to SMU registers */
        SMU_KEYS.U                       = (uint32)0x000000bc;
        /*Clear all SMU alarms for PLL and OSC*/
        MODULE_SMU.AGCF[alarmGroup][0].U = (MODULE_SMU.AGCF[alarmGroup][0].U & ~alarmMask);
        MODULE_SMU.AGCF[alarmGroup][1].U = (MODULE_SMU.AGCF[alarmGroup][1].U & ~alarmMask);
        MODULE_SMU.AGCF[alarmGroup][2].U = (MODULE_SMU.AGCF[alarmGroup][2].U & ~alarmMask);

        /* Clear the keys to avoid any further update to SMU registers */
        SMU_KEYS.U = (uint32)0U;
    }
    /* Select fback (fosc-evr) as CCU input clock */
    SCU_CCUCON0.B.CLKSEL = IfxScu_CCUCON0_CLKSEL_fBack;

    /* Update for all CCUCONx registers*/
    SCU_CCUCON0.B.UP = 1U;

    /* Providing delay between Clock source switch to Backup and PLL power down*/
    for (wait_cycles = 0; wait_cycles < IFXPMS_WAIT_CYCLES; wait_cycles++)
    {
        __nop();
    }

    /* PLL block is put into the Power Saving Mode */
    SCU_SYSPLLCON0.B.PLLPWD = 0U;
    SCU_PERPLLCON0.B.PLLPWD = 0U;

    /* Disable Oscillator*/
    SCU_OSCCON.B.MODE = 3U;

    /* Configure IRADIS bit to disable Idle Request Acknowledge sequence
     * activation for fast Standby Mode entry. This ensures that standby request
     * is not blocked by pending request or sequence*/

    SCU_PMSWCR1.B.IRADIS = 1U;

    /* Configure Standby entry through REQSLP bit setting only */
    SCU_PMSWCR1.B.STBYEVEN = 1U;
    SCU_PMSWCR1.B.STBYEV   = 0U;

    /* Set all pads to tristate and enable Standby RAM */

    pms->PMSWCR5.B.BPTRISTREQ = 1;
    pms->PMSWCR5.B.TRISTREQ   = 0;
    pms->PMSWCR0.B.STBYRAMSEL = config->standbyRam;

    IfxPmsPm_enableWakeup(pms, config);

    IfxScuWdt_setSafetyEndinit(safetyWdtPw);

    {
        /* Enable VCO unlock Trap if it was disabled before */
        IfxScuWdt_clearCpuEndinit(cpuWdtPw);
        SCU_TRAPCLR.B.SMUT      = 1U;
        SCU_TRAPDIS0.B.CPU0SMUT = smuTrapEnable;
        IfxScuWdt_setCpuEndinit(cpuWdtPw);
    }
#ifndef DEVICE_TC33X
    uint8 index = IfxCpu_getCoreIndex();
    IfxScuWdt_clearCpuEndinit(cpuWdtPw);

    switch (index)
    {
    case 0:
        MODULE_SCU.PMCSR0.B.REQSLP = powerMode;
        break;
    case 1:
        MODULE_SCU.PMCSR1.B.REQSLP = powerMode;
        break;
#if IFXCPU_NUM_MODULES > 2
    case 2:
        MODULE_SCU.PMCSR2.B.REQSLP = powerMode;
        break;
#endif
#if IFXCPU_NUM_MODULES > 3
    case 3:
        MODULE_SCU.PMCSR3.B.REQSLP = powerMode;
        break;
#endif
#if IFXCPU_NUM_MODULES > 4
    case 4:
        MODULE_SCU.PMCSR4.B.REQSLP = powerMode;
        break;
#endif
#if IFXCPU_NUM_MODULES > 5
    case 5:
        MODULE_SCU.PMCSR5.B.REQSLP = powerMode;
        break;
#endif
    }
#else
    IfxScuWdt_clearCpuEndinit(cpuWdtPw);
    MODULE_SCU.PMCSR0.B.REQSLP = powerMode;
#endif

    IfxScuWdt_setCpuEndinit(cpuWdtPw);
}


boolean IfxPmsPm_setCoreMode(IfxCpu_ResourceCpu cpuIndex, IfxCpu_CoreMode mode)
{
    uint8    reqSleep = (uint8)-1;
    boolean  retValue;
    Ifx_CPU *cpu;
#ifndef DEVICE_TC33X
    uint8    pmcIndex = cpuIndex;
#endif
    /*Modes such as HALT and STBY are not handled at CPU level */
    retValue = ((mode == IfxCpu_CoreMode_halt) || (mode == IfxCpu_CoreMode_stby)) ? FALSE : TRUE;

    switch (mode)
    {
    case IfxCpu_CoreMode_idle:
        reqSleep = IfxScu_PMCSR_REQSLP_Idle;
        break;
    case IfxCpu_CoreMode_run:
        reqSleep = IfxScu_PMCSR_REQSLP_Run;
        break;
    case IfxCpu_CoreMode_sleep:
        reqSleep = IfxScu_PMCSR_REQSLP_Sleep;
        break;
    default:
        return 0;
    }

    if (retValue == TRUE)
    {
        /*Check if the same core is requesting to change the core run mode */
        if (IfxCpu_getCoreIndex() != cpuIndex)
        {                       /*Request is for the other core */
            /*To access PMCSR of other CPUs handle the safety EndInit protection */
            uint16 safetyWdtPw = IfxScuWdt_getSafetyWatchdogPassword();
            IfxScuWdt_clearSafetyEndinit(safetyWdtPw);
#ifndef DEVICE_TC33X
            switch (pmcIndex)
            {
            case 0:
                MODULE_SCU.PMCSR0.B.REQSLP = reqSleep;
                break;
#if IFXCPU_NUM_MODULES > 1
            case 1:
                MODULE_SCU.PMCSR1.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 1*/
#if IFXCPU_NUM_MODULES > 2
            case 2:
                MODULE_SCU.PMCSR2.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 2*/
#if IFXCPU_NUM_MODULES > 3
            case 3:
                MODULE_SCU.PMCSR3.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 3*/
#if IFXCPU_NUM_MODULES > 4
            case 4:
                MODULE_SCU.PMCSR4.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 4*/
#if IFXCPU_NUM_MODULES > 5
            case 5:
                MODULE_SCU.PMCSR5.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 5*/
            }
#else
            MODULE_SCU.PMCSR0.B.REQSLP = reqSleep;
#endif /*#ifndef DEVICE_TC33X*/
            IfxScuWdt_setSafetyEndinit(safetyWdtPw);
            cpu               = IfxCpu_getAddress(cpuIndex);
            cpu->DBGSR.B.HALT = 2; /*reset the HALT bit, if it is already done it is no harm in writing again */
        }
        else
        {                          /*Request is for self, this request normally only for halt, otherwise the core is already running anyway! */
            /*To access PMCSR of self handle the cpu EndInit protection */
            uint16 cpuWdtPw = IfxScuWdt_getCpuWatchdogPassword();
            IfxScuWdt_clearCpuEndinit(cpuWdtPw);
#ifndef DEVICE_TC33X
            switch (pmcIndex)
            {
            case 0:
                MODULE_SCU.PMCSR0.B.REQSLP = reqSleep;
                break;
#if IFXCPU_NUM_MODULES > 1
            case 1:
                MODULE_SCU.PMCSR1.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 1*/
#if IFXCPU_NUM_MODULES > 2
            case 2:
                MODULE_SCU.PMCSR2.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 2*/
#if IFXCPU_NUM_MODULES > 3
            case 3:
                MODULE_SCU.PMCSR3.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 3*/
#if IFXCPU_NUM_MODULES > 4
            case 4:
                MODULE_SCU.PMCSR4.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 4*/
#if IFXCPU_NUM_MODULES > 5
            case 5:
                MODULE_SCU.PMCSR5.B.REQSLP = reqSleep;
                break;
#endif /*IFXCPU_NUM_MODULES > 5*/
            }
#else
            MODULE_SCU.PMCSR0.B.REQSLP = reqSleep;
#endif /*#ifndef DEVICE_TC33X*/

            IfxScuWdt_setCpuEndinit(cpuWdtPw);
        }
    }

    return retValue;
}


