Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Pms/Std/IfxPmsPm.c
void IfxPmsPm_enableWakeup(Ifx_PMS *pms, IfxPmsPm_WakeupConfig *wakeup)
{
    Ifx_PMS_PMSWCR0 tempPMSW;

    switch (wakeup->wakeup)
    {
    case IfxPmsPm_WakeupOn_esr0:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.PORSTWKEN = 0;
        tempPMSW.B.ESR0WKEN  = 1;
        tempPMSW.B.ESR0DFEN  = wakeup->filter;
        tempPMSW.B.ESR0EDCON = wakeup->trigger;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    case IfxPmsPm_WakeupOn_esr1:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.PORSTWKEN = 0;
        tempPMSW.B.ESR1WKEN  = 1;
        tempPMSW.B.ESR1DFEN  = wakeup->filter;
        tempPMSW.B.ESR1EDCON = wakeup->trigger;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    case IfxPmsPm_WakeupOn_pinA:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.PORSTWKEN = 0;
        tempPMSW.B.PINAWKEN  = 1;
        tempPMSW.B.PINADFEN  = wakeup->filter;
        tempPMSW.B.PINAEDCON = wakeup->trigger;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    case IfxPmsPm_WakeupOn_pinB:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.PORSTWKEN = 0;
        tempPMSW.B.PINBWKEN  = 1;
        tempPMSW.B.PINBDFEN  = wakeup->filter;
        tempPMSW.B.PINBEDCON = wakeup->trigger;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    case IfxPmsPm_WakeupOn_timer:
        tempPMSW.U         = pms->PMSWCR0.U;
        tempPMSW.B.WUTWKEN = 1;
        pms->PMSWCR0.U     = tempPMSW.U;
        pms->PMSWCR3.U    |= ((wakeup->mode << 30) | (1 << 27) | (wakeup->reloadCounter));
        break;
    case IfxPmsPm_WakeupOn_porst:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.PORSTWKEN = 1;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    case IfxPmsPm_WakeupOn_scr:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.SCRWKEN   = 1;
        tempPMSW.B.PORSTWKEN = 0;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    case IfxPmsPm_WakeupOn_power:
        tempPMSW.U         = pms->PMSWCR0.U;
        tempPMSW.B.PWRWKEN = 1;
        pms->PMSWCR0.U     = tempPMSW.U;
        break;
    default:
        tempPMSW.U           = pms->PMSWCR0.U;
        tempPMSW.B.PORSTWKEN = 1;
        pms->PMSWCR0.U       = tempPMSW.U;
        break;
    }
}


void IfxPmsPm_configureSupplyMonitoring(Ifx_PMS *pms, IfxPmsPm_VoltageSource source, IfxPmsPm_ThresholdEvent event, IfxPmsPm_RampingMode mode)
{
    uint16 safetyWdtPw = IfxScuWdt_getSafetyWatchdogPassword();
    IfxScuWdt_clearSafetyEndinit(safetyWdtPw);
    uint32 mask        = 0x3 << (source + event);
    pms->MONCTRL.U = (pms->MONCTRL.U & ~mask) | ((mode & 0x3) << (source + event)); //ramp & 0x3 added to ensure that even if a value>3 is passed as an argument and compiler doesn't catch it, other bits aren't screwed up.
    IfxScuWdt_setSafetyEndinit(safetyWdtPw);
}


void IfxPmsPm_initStandbyConfig(IfxPmsPm_StandbyConfig *standbyConfig)
{
    standbyConfig->trigger                        = IfxPmsPm_StandbyTriggerMode_hardware_undervoltage;
    standbyConfig->standbyRamBlock                = IfxPmsPm_StandbyRamSupply_cpu0Cpu1;
    standbyConfig->enableScr                      = TRUE;
    standbyConfig->minDelayBeforeWakeUp           = IfxPmsPm_BlankingFilterDelay_5ms;
    standbyConfig->vextUnderVoltageThresholdLevel = 0x0;
    standbyConfig->vddUnderVoltageThresholdLevel  = 0x0;

    standbyConfig->enableStandbyOnVextRampDown    = FALSE;
    standbyConfig->enableStandbyOnVddRampDown     = FALSE;
    standbyConfig->scrClockSupply                 = IfxPmsPm_ScrClocking_100mhzOptional;
    standbyConfig->esr0PinStateRequest            = IfxPmsPm_Esr0PinStateRequest_tristate;
    standbyConfig->padStateRequest                = IfxPmsPm_PadStateRequest_tristate;
    standbyConfig->enableWakeupOnEsr0             = FALSE;
    standbyConfig->enableWakeupOnEsr1             = FALSE;
    standbyConfig->enableWakeupOnPinA             = FALSE;
    standbyConfig->enableWakeupOnPinB             = FALSE;
    standbyConfig->enableWakeupOnPorst            = TRUE;
    standbyConfig->enableWakeupOnScr              = FALSE;
    standbyConfig->enableWakeupOnPower            = FALSE;
    standbyConfig->enableWakeupOnTimer            = FALSE;
    standbyConfig->wutClock                       = IfxPmsPm_WutClock_70kHz;
    standbyConfig->useWutStandbyAutoStopMode      = FALSE;
    standbyConfig->wutReloadValue                 = 0xFFFF000;

    standbyConfig->esr0DigitalFilterUsage         = IfxPmsPm_DigitalFilter_used;
    standbyConfig->esr1DigitalFilterUsage         = IfxPmsPm_DigitalFilter_used;
    standbyConfig->pinADigitalFilterUsage         = IfxPmsPm_DigitalFilter_used;
    standbyConfig->pinBDigitalFilterUsage         = IfxPmsPm_DigitalFilter_used;

    standbyConfig->esr0TriggerEvent               = IfxPmsPm_PinEdgeTriggerEvent_risingEdge;
    standbyConfig->esr1TriggerEvent               = IfxPmsPm_PinEdgeTriggerEvent_risingEdge;
    standbyConfig->pinATriggerEvent               = IfxPmsPm_PinEdgeTriggerEvent_risingEdge;
    standbyConfig->pinBTriggerEvent               = IfxPmsPm_PinEdgeTriggerEvent_risingEdge;
}


void IfxPmsPm_startStandbySequenceInFlash(IfxPmsPm_StandbyConfig *standbyConfig, const IfxScuCcu_Config *clockConfig)
{
    uint16          endinitSfty_pw;
    Ifx_SCU_PMSWCR1 pmswcr1;

    IFXPMS_DISABLE_ALL_MODULES_STANDBY
/*Setting the current CPU as the Master CPU.Care has to be taken while locating IfxPmsPm_runStandbySequenceInPSPR() and standbyConfig in RAM.*/

    IfxPmsPm_setMasterCpu(IfxCpu_getCoreIndex());

    standbyConfig->masterCpu = IfxPmsPm_getMasterCpu();

/*Disabling interrupts for all CPUs except the Master CPU, a designation assigned to current CPU using IfxPmsPm_setMasterCpu(). This is to avoid wakeup
 * of the CPUs once they are put into IDLE state.*/
#ifndef DEVICE_TC33X
    IfxCpu_disableInterruptsAllExceptMaster(IfxCpu_getCoreIndex());

/*Placing all CPUs to Idle state except the Master CPU, a designation assigned to current CPU using IfxPmsPm_setMasterCpu().*/
    IfxCpu_setAllIdleExceptMasterCpu(IfxCpu_getCoreIndex());
#endif

    endinitSfty_pw = IfxScuWdt_getSafetyWatchdogPasswordInline();
    IfxScuWdt_clearSafetyEndinitInline(endinitSfty_pw);

/*Clearing all overrun and wakeup status bits.*/
    PMS_PMSWSTATCLR.U = (PMS_PMSWSTATCLR.U | 0xEFFF);

/*Choosing Standby entry mode in the case of both VEVRSB and VEXT remaining active in Standby Mode*/
    if ((standbyConfig->trigger == IfxPmsPm_StandbyTriggerMode_software) || (standbyConfig->trigger == IfxPmsPm_StandbyTriggerMode_hardware_nmi))
    {
        pmswcr1.U          = SCU_PMSWCR1.U;
        pmswcr1.B.STBYEVEN = 1;
        pmswcr1.B.STBYEV   = standbyConfig->trigger;
        SCU_PMSWCR1.U      = pmswcr1.U;
    }

    if (standbyConfig->enableStandbyOnVextRampDown)
    {
        PMS_PMSWCR0.B.VEXTSTBYEN = 1;
    }

    if (standbyConfig->enableStandbyOnVddRampDown)
    {
        PMS_PMSWCR0.B.VDDSTBYEN = 1;
    }

