Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Pms/Std/IfxPmsPm.c
    IfxScuWdt_setSafetyEndinitInline(endinitSfty_pw);

    if (standbyConfig->enableStandbyOnVextRampDown)
    {
        IfxPmsEvr_setSecondaryUnderVoltageThresholdMv(&MODULE_PMS, standbyConfig->vextUnderVoltageThresholdLevel, IfxPmsEvr_SupplyMode_swd);
    }

    if (standbyConfig->enableStandbyOnVddRampDown)
    {
        IfxPmsEvr_setSecondaryUnderVoltageThresholdMv(&MODULE_PMS, standbyConfig->vddUnderVoltageThresholdLevel, IfxPmsEvr_SupplyMode_evrc);
    }

/*Configuring Wakeup modes.*/
    IfxPmsPm_configureWakeup(standbyConfig);

/* Frequency Ramp-down and switching of clock source to 100MHz Backup clock */
    uint32                      pllStepsCount;
    IfxScuCcu_PllThrottleConfig pllThrottleConfig = clockConfig->sysPllThrottleConfig;

    if (SCU_CCUCON0.B.CLKSEL != 0) /* If source not already using backup clock */
    {
        endinitSfty_pw = IfxScuWdt_getSafetyWatchdogPasswordInline();

        /*Start Pll ramp down sequence */
        for (pllStepsCount = pllThrottleConfig.numOfSteps; pllStepsCount > 0; pllStepsCount--)
        {                   /*iterate through number of pll steps */
            {
                IfxScuWdt_clearSafetyEndinitInline(endinitSfty_pw);

                /*Configure K2 divider */
                while (SCU_SYSPLLSTAT.B.K2RDY == 0U)
                {
                    /*Wait until K2 divider is ready */
                    /*No "timeout" required, because if it hangs, Safety Endinit will give a trap */
                }

                /*Now set the K2 divider value for the step corresponding to step count */
                SCU_SYSPLLCON1.B.K2DIV = pllThrottleConfig.pllSteps[pllStepsCount - 1].k2Step;
                IfxScuWdt_setSafetyEndinitInline(endinitSfty_pw);

                /*Wait for waitCounter corresponding to the pll step */
                //IfxScuCcu_wait(pllThrottleConfig.pllSteps[pllStepsCount - 1].waitTime);
            }
        }

        /* Reset Safety ENDINIT, SCU_CCUCON registers are protected*/
        IfxScuWdt_clearSafetyEndinitInline(endinitSfty_pw);

        while (SCU_CCUCON0.B.LCK != 0U)
        {} /*Wait till ccucon0 lock is set, No "timeout" required, ENDINIT watch-dog is active! */

        {
            Ifx_SCU_CCUCON0 scu_ccucon0;
            scu_ccucon0.U        = SCU_CCUCON0.U;
            scu_ccucon0.B.CLKSEL = 0; /*Select the EVR as fsource0/1/2 for the clock distribution */
            scu_ccucon0.B.UP     = 1; /*Update the ccucon0 register */
            SCU_CCUCON0.U        = scu_ccucon0.U;
        }
    }

    IfxScuWdt_setSafetyEndinitInline(endinitSfty_pw);
}


void IfxPmsPm_continueStandbySequenceInRAM(IfxPmsPm_StandbyConfig *standbyConfig, const IfxScuCcu_Config *clockConfig)
{
    uint16 endinitSfty_pw = 0;
    uint16 cpuPassword    = 0;

    IFX_UNUSED_PARAMETER(clockConfig);
    /*Putting Flash to Sleep*/
    DMU_HF_PCONTROL.B.SLEEP = 0x3;

/*Waiting for flash to enter sleep mode*/
    while (!DMU_HF_PSTATUS.B.SLEEP)
    {}

    endinitSfty_pw = IfxScuWdt_getSafetyWatchdogPasswordInline();
    IfxScuWdt_clearSafetyEndinitInline(endinitSfty_pw);

    /*Clock dividers for SPB, SRI, BBB, FSI, GETH, GTM, ADAS programmed to have lowest frequency*/
    SCU_CCUCON0.B.LPDIV = 0x4;

/* Shutting down System PLL and Peripheral PLL */

    SCU_SYSPLLCON0.B.PLLPWD = 0U;
    SCU_PERPLLCON0.B.PLLPWD = 0U;

/*Disabling SMU Standby module*/
    Ifx_PMS_CMD_STDBY cmdStdby;
    cmdStdby.U         = PMS_CMD_STDBY.U;
    cmdStdby.B.SMUEN   = 0;
    cmdStdby.B.BITPROT = 1;
    PMS_CMD_STDBY.U    = cmdStdby.U;

/* Disabling Idle Request Acknowledge sequence activation for fast Standby Mode entry so that standby request is not blocked by a pending reset idle request acknowledge sequence */
    SCU_PMSWCR1.B.IRADIS = 1U;

/*Disabling possibilities for Application Reset and System Reset*/
    MODULE_SCU.RSTCON.U = 0U;

    Ifx_PMS_PMSWCR0 pmswcr0;
    pmswcr0.U         = PMS_PMSWCR0.U;
/* Setting the amount of blanking filter delay required */
    pmswcr0.B.BLNKFIL = standbyConfig->minDelayBeforeWakeUp;

/* Select standby RAM region to be powered on during standby */
    pmswcr0.B.STBYRAMSEL = standbyConfig->standbyRamBlock;

/*Configuring the Pins for use in wakeup mode*/

    if ((standbyConfig->trigger == IfxPmsPm_StandbyTriggerMode_software) || (standbyConfig->trigger == IfxPmsPm_StandbyTriggerMode_hardware_nmi))
    {
        pmswcr0.B.ESR0DFEN  = standbyConfig->esr0DigitalFilterUsage;
        pmswcr0.B.ESR1DFEN  = standbyConfig->esr1DigitalFilterUsage;
        pmswcr0.B.PINADFEN  = standbyConfig->pinADigitalFilterUsage;
        pmswcr0.B.PINBDFEN  = standbyConfig->pinBDigitalFilterUsage;

        pmswcr0.B.ESR0EDCON = standbyConfig->esr0TriggerEvent;
        pmswcr0.B.ESR1EDCON = standbyConfig->esr1TriggerEvent;
        pmswcr0.B.PINAEDCON = standbyConfig->pinATriggerEvent;
        pmswcr0.B.PINBEDCON = standbyConfig->pinBTriggerEvent;
    }

    PMS_PMSWCR0.U = pmswcr0.U;

/* Configuring state of port pins and ESR0 pins upon wakeup */
    Ifx_PMS_PMSWCR5 pmswcr5;
    pmswcr5.U            = PMS_PMSWCR5.U;
    pmswcr5.B.BPTRISTREQ = 1;
    pmswcr5.B.TRISTREQ   = 1;
    pmswcr5.B.BPTRISTREQ = 1;
    pmswcr5.B.ESR0TRIST  = 1;
    PMS_PMSWCR5.U        = pmswcr5.U;

/* Configuring Standby Controller(SCR) if usage during standby mode is enabled */

    Ifx_PMS_PMSWCR4 pmswcr4;
    pmswcr4.U           = PMS_PMSWCR4.U;
    pmswcr4.B.BPSCREN   = 1U;
    pmswcr4.B.SCREN     = standbyConfig->enableScr;
/* SCR clock supply configuration */
    pmswcr4.B.SCRCLKSEL = standbyConfig->scrClockSupply;

    if (standbyConfig->trigger == IfxPmsPm_StandbyTriggerMode_hardware_undervoltage)
    {
/* Disabling reset of SCR due to standby entry*/
        pmswcr4.B.PORSTREQ = 0;
    }

    PMS_PMSWCR4.U = pmswcr4.U;

    IfxScuWdt_setSafetyEndinitInline(endinitSfty_pw);
/* In case of manual standby entry using software, requesting Standby entry and waiting for Standby Reqested status */
    cpuPassword = IfxScuWdt_getCpuWatchdogPasswordInline(&MODULE_SCU.WDTCPU[standbyConfig->masterCpu]);

