Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Pms/Std/IfxPmsPm.c
    if (standbyConfig->trigger == IfxPmsPm_StandbyTriggerMode_software)
    {
        IfxScuWdt_clearCpuEndinitInline(&MODULE_SCU.WDTCPU[standbyConfig->masterCpu], cpuPassword);
#ifndef DEVICE_TC33X
        switch (standbyConfig->masterCpu)
        {
        case IfxCpu_ResourceCpu_0: SCU_PMCSR0.B.REQSLP = 0x3;
            break;
#if IFXCPU_NUM_MODULES > 1
        case IfxCpu_ResourceCpu_1: SCU_PMCSR1.B.REQSLP = 0x3;
            break;
#endif/*IFXCPU_NUM_MODULES > 1*/
#if IFXCPU_NUM_MODULES > 2
        case IfxCpu_ResourceCpu_2: SCU_PMCSR2.B.REQSLP = 0x3;
            break;
#endif/*IFXCPU_NUM_MODULES > 2*/
#if IFXCPU_NUM_MODULES > 3
        case IfxCpu_ResourceCpu_3: SCU_PMCSR3.B.REQSLP = 0x3;
            break;
#endif/*IFXCPU_NUM_MODULES > 3*/
#if IFXCPU_NUM_MODULES > 4
        case IfxCpu_ResourceCpu_4: SCU_PMCSR4.B.REQSLP = 0x3;
            break;
#endif/*IFXCPU_NUM_MODULES > 4*/
#if IFXCPU_NUM_MODULES > 5
        case IfxCpu_ResourceCpu_5: SCU_PMCSR5.B.REQSLP = 0x3;
            break;
#endif/*IFXCPU_NUM_MODULES > 5*/
        default:
            /* Invalid core selected */
            break;
        }
#else
        SCU_PMCSR0.B.REQSLP = 0x3;
#endif/*#ifndef DEVICE_TC33X*/
    }

    IfxScuWdt_setCpuEndinitInline(&MODULE_SCU.WDTCPU[standbyConfig->masterCpu], cpuPassword);
}


void IfxPmsPm_configureWakeup(IfxPmsPm_StandbyConfig *standbyConfig)
{
    uint16          endinitSfty_pw;
    Ifx_PMS_PMSWCR0 pmswcr0;
    Ifx_PMS_PMSWCR3 pmswcr3;
    pmswcr0.U           = PMS_PMSWCR0.U;
    pmswcr3.U           = PMS_PMSWCR3.U;

    pmswcr0.B.ESR0WKEN  = standbyConfig->enableWakeupOnEsr0;
    pmswcr0.B.ESR1WKEN  = standbyConfig->enableWakeupOnEsr1;
    pmswcr0.B.PINAWKEN  = standbyConfig->enableWakeupOnPinA;
    pmswcr0.B.PINBWKEN  = standbyConfig->enableWakeupOnPinB;
    pmswcr0.B.PWRWKEN   = standbyConfig->enableWakeupOnPower;
    pmswcr0.B.SCRWKEN   = standbyConfig->enableWakeupOnScr;
    pmswcr0.B.PORSTWKEN = standbyConfig->enableWakeupOnPorst;
    pmswcr0.B.WUTWKEN   = standbyConfig->enableWakeupOnTimer;

    if ((standbyConfig->enableWakeupOnTimer == TRUE) && (standbyConfig->useWutStandbyAutoStopMode == TRUE))
    {
        /* Setting the clock input for WUT*/
        pmswcr3.B.WUTDIV  = standbyConfig->wutClock;
        /*Enable Wakeup Timer*/
        pmswcr3.B.WUTEN   = TRUE;
        /* Load the value from which the WUT will start downward count upon entering Standby */
        pmswcr3.B.WUTREL  = standbyConfig->wutReloadValue;
        /* Selecting WUT Auto Stop Mode */
        pmswcr3.B.WUTMODE = 1;
    }

    /*get the watch-dog passwords for usage with this function*/
    endinitSfty_pw = IfxScuWdt_getSafetyWatchdogPasswordInline();
    IfxScuWdt_clearSafetyEndinitInline(endinitSfty_pw);
    PMS_PMSWCR0.U  = pmswcr0.U;
    PMS_PMSWCR3.U  = pmswcr3.U;
    IfxScuWdt_setSafetyEndinitInline(endinitSfty_pw);
}


void IfxPmsPm_initSleepConfig(IfxPmsPm_SleepConfig *sleepConfig)
{
    sleepConfig->mcanEnabled       = FALSE;
    sleepConfig->mcanClockSource   = IfxScuCcu_Fsource_0;
    sleepConfig->asclinEnabled     = FALSE;
    sleepConfig->asclinClockSource = IfxScuCcu_Fsource_0;
    sleepConfig->gpt12Enabled      = FALSE;
    sleepConfig->ccu6Enabled       = FALSE;
    sleepConfig->qspiEnabled       = FALSE;
    sleepConfig->qspiClockSource   = IfxScuCcu_Fsource_0;
    sleepConfig->gethEnabled       = FALSE;
    sleepConfig->i2cEnabled        = FALSE;
    sleepConfig->gtmEnabled        = FALSE;
    sleepConfig->stmEnabled        = FALSE;
}


void IfxPmsPm_startSleepSequenceinFlash(IfxPmsPm_SleepConfig *sleepConfig, IfxScuCcu_Config *clockConfig)
{
    uint16 endinitSfty_pw = 0;

/*Set current CPU as the Master CPU*/

    IfxPmsPm_setMasterCpu(IfxCpu_getCoreIndex());

    sleepConfig->masterCpu = IfxPmsPm_getMasterCpu();

/*Placing all CPUs to Idle state except the Master CPU, a designation assigned to current CPU using IfxPmsPm_setMasterCpu().*/
#ifndef DEVICE_TC33X
    IfxCpu_setAllIdleExceptMasterCpu(IfxCpu_getCoreIndex());
#endif
    IFXPMS_DISABLE_MODULES_DURING_SLEEP

/*Disable(or not) SYSPLL and PERPLL depending on which modules are required to be kept active*/

    Ifx_SCU_SYSPLLCON0 syspllcon0;
    Ifx_SCU_PERPLLCON0 perpllcon0;
    syspllcon0.U        = SCU_SYSPLLCON0.U;
    perpllcon0.U        = SCU_PERPLLCON0.U;

    syspllcon0.B.PLLPWD = 0; //Setting in Power Saving Mode.Will enable it if any of the modules(GPT12(through SPB),CCU6(through SPB),GETH,GTM,STM) need it.
    perpllcon0.B.PLLPWD = 0; //Setting in Power Saving Mode.Will enable it if any of the modules need it.

    if (sleepConfig->gpt12Enabled || sleepConfig->ccu6Enabled || sleepConfig->gethEnabled || sleepConfig->gtmEnabled || sleepConfig->stmEnabled)
    {
        syspllcon0.B.PLLPWD = 1;
    }

    if (sleepConfig->qspiEnabled | sleepConfig->i2cEnabled)
    {
        perpllcon0.B.PLLPWD = 1;
    }

    if ((sleepConfig->mcanEnabled && (sleepConfig->mcanClockSource == IfxScuCcu_Fsource_1)) || (sleepConfig->asclinEnabled && (sleepConfig->asclinClockSource == IfxScuCcu_Fsource_1)))
    {
        perpllcon0.B.PLLPWD = 1;
    }

    endinitSfty_pw = IfxScuWdt_getSafetyWatchdogPasswordInline();
    IfxScuWdt_clearSafetyEndinitInline(endinitSfty_pw);

    SCU_SYSPLLCON0.U            = syspllcon0.U;
    SCU_PERPLLCON0.U            = perpllcon0.U;
/*Clock dividers for SPB, SRI, BBB, FSI, GETH, GTM, ADAS programmed to operate at lowest frequency*/
    SCU_CCUCON0.B.LPDIV         = 0x4;
    SCU_CCUCON0.B.UP            = 1;
    SCU_CCUCON1.B.CLKSELMCAN    = sleepConfig->mcanClockSource;
    SCU_CCUCON2.B.CLKSELASCLINS = sleepConfig->asclinClockSource;
    SCU_CCUCON1.B.CLKSELQSPI    = sleepConfig->qspiClockSource;

    IfxScuWdt_setSafetyEndinitInline(endinitSfty_pw);

    if (!(sleepConfig->asclinEnabled || sleepConfig->mcanEnabled || sleepConfig->gpt12Enabled || sleepConfig->ccu6Enabled || sleepConfig->qspiEnabled || sleepConfig->gethEnabled || sleepConfig->i2cEnabled || sleepConfig->gtmEnabled || sleepConfig->stmEnabled))
    {
        IfxScuCcu_switchToBackupClock(clockConfig);
    }

    IfxPmsPm_continueSleepSequenceInRAM(sleepConfig);
}


void IfxPmsPm_continueSleepSequenceInRAM(IfxPmsPm_SleepConfig *sleepConfig)
{
    uint16 endinit_pw = 0;

