Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Pms/Std/IfxPmsPm.c
/*Putting Flash to Sleep*/
    DMU_HF_PCONTROL.B.SLEEP = 3;

/*Waiting for flash to sleep*/
    while (!DMU_HF_PSTATUS.B.SLEEP)
    {}

    endinit_pw = IfxScuWdt_getCpuWatchdogPasswordInline(&MODULE_SCU.WDTCPU[sleepConfig->masterCpu]);

    IfxScuWdt_clearCpuEndinitInline(&MODULE_SCU.WDTCPU[IfxCpu_getCoreIndex()], endinit_pw);
#ifndef DEVICE_TC33X
    switch (sleepConfig->masterCpu)
    {
    case IfxCpu_ResourceCpu_0: SCU_PMCSR0.B.REQSLP = 0x2;

        while (SCU_PMCSR0.B.PMST == 0x4)
        {}

        break;
#if IFXCPU_NUM_MODULES > 1
    case IfxCpu_ResourceCpu_1: SCU_PMCSR1.B.REQSLP = 0x2;

        while (SCU_PMCSR1.B.PMST == 0x4)
        {}

        break;
#endif /*IFXCPU_NUM_MODULES > 1*/
#if IFXCPU_NUM_MODULES > 2
    case IfxCpu_ResourceCpu_2: SCU_PMCSR2.B.REQSLP = 0x2;

        while (SCU_PMCSR2.B.PMST == 0x4)
        {}

        break;
#endif /*IFXCPU_NUM_MODULES > 2*/
#if IFXCPU_NUM_MODULES > 3
    case IfxCpu_ResourceCpu_3: SCU_PMCSR3.B.REQSLP = 0x2;

        while (SCU_PMCSR3.B.PMST == 0x4)
        {}

        break;
#endif /*IFXCPU_NUM_MODULES > 3*/
#if IFXCPU_NUM_MODULES > 4
    case IfxCpu_ResourceCpu_4: SCU_PMCSR4.B.REQSLP = 0x2;

        while (SCU_PMCSR4.B.PMST == 0x4)
        {}

        break;
#endif /*IFXCPU_NUM_MODULES > 4*/
#if IFXCPU_NUM_MODULES > 5
    case IfxCpu_ResourceCpu_5: SCU_PMCSR5.B.REQSLP = 0x2;

        while (SCU_PMCSR5.B.PMST == 0x4)
        {}

        break;
#endif /*IFXCPU_NUM_MODULES > 5*/
    default:
        /* Invalid core selected */
        break;
    }
#else
    SCU_PMCSR0.B.REQSLP = 0x2;
    while (SCU_PMCSR0.B.PMST == 0x4)
    {}
#endif /*#ifndef DEVICE_TC33X*/

    IfxScuWdt_setCpuEndinitInline(&MODULE_SCU.WDTCPU[sleepConfig->masterCpu], endinit_pw);
}


void IfxPmsPm_initiateWakeup(IfxScuCcu_Config *clockConfig)
{
    /*Put Flash to Normal mode from Sleep*/

    DMU_HF_PCONTROL.B.SLEEP = 0;

/*Wait till Flash is active*/

    while (DMU_HF_PSTATUS.B.SLEEP)
    {}

    IfxScuCcu_init(clockConfig);

    IFXPMS_WAKEUP_MODULES

        IFXPMS_RESTART_EXECUTION
}


void IfxPmsPm_initLoadJumpConfig(IfxPmsPm_LoadJumpConfig *loadJumpConfig)
{
    loadJumpConfig->enableLoadJumpTimer                  = TRUE;
    loadJumpConfig->enableLoadJumpTimerOverflowFlag      = TRUE;
    loadJumpConfig->enableLoadJumpTimerOverflowInterrupt = FALSE;
}


void IfxPmsPm_initAndRequestLoadJump(IfxPmsPm_LoadJumpConfig *loadJumpConfig)
{
    uint16 safetyWdtPw = IfxScuWdt_getSafetyWatchdogPassword();
    IfxScuWdt_clearSafetyEndinit(safetyWdtPw);

    SCU_PMTRCSR0.B.LJTEN    = loadJumpConfig->enableLoadJumpTimer;
    SCU_PMTRCSR0.B.LJTOVEN  = loadJumpConfig->enableLoadJumpTimerOverflowFlag;
    SCU_PMTRCSR0.B.LJTOVIEN = loadJumpConfig->enableLoadJumpTimerOverflowInterrupt;
    __dsync();
    SCU_PMTRCSR2.B.LDJMPREQ = 1U;
    IfxScuWdt_setSafetyEndinit(safetyWdtPw);
}


void IfxPmsPm_initVoltageDroopConfig(IfxPmsPm_VoltageDroopConfig *voltageDroopConfig)
{
    /*Enabling usage of Voltage Droop Timer*/
    voltageDroopConfig->enableVoltageDroopTimer                  = TRUE;
    /*Enabling update of Voltage Droop Timer Overflow Flag in event of overflow*/
    voltageDroopConfig->enableVoltageDroopTimerOverflowFlag      = TRUE;
    /*Disabling Voltage Droop Timer interrupt*/
    voltageDroopConfig->enableVoltageDroopTimerOverflowInterrupt = FALSE;
/* Requesting for a reduction voltage(negative voltage droop)*/
    voltageDroopConfig->droopRequestType                         = IfxPmsPm_VoltageDroopRequest_negative;
/*The amount by which voltage change is required is 40mV*/
    voltageDroopConfig->droopStep                                = IfxPmsPm_VoltageDroopStep_40mV;
}


void IfxPmsPm_initAndRequestVoltageDroop(IfxPmsPm_VoltageDroopConfig *voltageDroopConfig)
{
    uint16 safetyWdtPw = IfxScuWdt_getSafetyWatchdogPassword();
    IfxScuWdt_clearSafetyEndinit(safetyWdtPw);

    SCU_PMTRCSR0.B.VDTEN     = voltageDroopConfig->enableVoltageDroopTimer;
    SCU_PMTRCSR0.B.VDTOVEN   = voltageDroopConfig->enableVoltageDroopTimerOverflowFlag;
    SCU_PMTRCSR0.B.VDTOVIEN  = voltageDroopConfig->enableVoltageDroopTimerOverflowInterrupt;
    SCU_PMTRCSR0.B.SDSTEP    = voltageDroopConfig->droopStep;
    __dsync();
    SCU_PMTRCSR3.B.VDROOPREQ = voltageDroopConfig->droopRequestType;
    IfxScuWdt_setSafetyEndinit(safetyWdtPw);
}


void IfxPmsPm_handleStandbyRam(uint32 *dataPointer, uint8 dataSize)
{
    uint32 *redundantDataPointer = (uint32 *)dataPointer;

    uint32  i;

    for (i = 0U; i < dataSize; i++)
    {
        {
            /*Effectively reading addresses from redundantDataPointer and replacing it with data in those addresses*/
            uint32 *temp;
            /*Copy the data(which is an address) into temp pointer */
            temp                  = (uint32 *)(*redundantDataPointer);
            /*Copy the data in temp pointer to redundant data pointer*/
            *redundantDataPointer = *temp;
        }
        redundantDataPointer++;
    }

    /*Calculate the CRC over all the copied data*/
    *redundantDataPointer = IfxCpu_calculateCrc32(dataPointer, dataSize);
}
